<?php 
	
	/*****
	*
	*	Права доступа
	*
	*****/

	/*
	
	            Owner         Group         Users
	=====================================================
	read          1             1             1          | 4
	write         1             0             0          | 2
	execute       1             0             0          | 1
	=====================================================
                  7             4             4		

	*/
	
	echo __FILE__; // Показывает, где находится файл
	echo "<br>";
	echo fileperms(__FILE__);

	chmod(__FILE__, 0777); // Изменяем права доступа


 ?>